Autodesk.Revit.DB.ImportExportFileFormat
Describes formats supported by import / export.
Since:
2010

Autodesk.Revit.DB.ImportExportFileFormat.NWC
Navisworks format

Autodesk.Revit.DB.ImportExportFileFormat.IFC
IFC format

Autodesk.Revit.DB.ImportExportFileFormat.SAT
SAT format

Autodesk.Revit.DB.ImportExportFileFormat.DXF
DXF format

Autodesk.Revit.DB.ImportExportFileFormat.Inventor
Inventor format

Autodesk.Revit.DB.ImportExportFileFormat.Civil3D
Civel3D format

Autodesk.Revit.DB.ImportExportFileFormat.DGN
DGN format

Autodesk.Revit.DB.ImportExportFileFormat.Image
Image format

Autodesk.Revit.DB.ImportExportFileFormat.FBX
FBX format

Autodesk.Revit.DB.ImportExportFileFormat.GBXML
GBXML format

Autodesk.Revit.DB.ImportExportFileFormat.DWFX
DWFX format

Autodesk.Revit.DB.ImportExportFileFormat.DWF
DWF format

Autodesk.Revit.DB.ImportExportFileFormat.DWG
DWG format